## Задача №4:
#
# В соседнем районе рождественские эльфы готовят подарки для жителей города.
# Для каждого подарка (файл data/4.txt) нужно найти сколько оберточной бумаги потребуется.
# Формула рассчета: 2*ш*д + 2*д*в + 2*в*ш + площадь наименьшей стороны
# Например, на подарок размером 2х3х4 требуется 2*6 + 2*12 + 2*8 = 52 + 6 кв. см.
#
# Сколько всего оберточной бумаги нужно купить эльфам?
#
## Требования к решению:
# - Входные данные находятся в файле data/4.txt
# - В значениях данные длины, ширины и высоты не упорядочены и могут идти в любом порядке, однако
# длина всегда наименьшее число из трех, высота - среднее, ширина - самое большое.
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:
res = 0
file = File.open('data\\4.txt', 'r')
for line in file.readlines()
    a = line.split('x').map(&:to_i)
    b = [ a[0]*a[1] , a[1]*a[2] , a[2]*a[0] ]
    res += 2 * b.inject(0, :+) + b.min
end
file.close()
puts "Эльфам понадобится #{res} кв. см оберточной бумаги"
